In [201]:
import pandas as pd
import numpy as np

In [202]:
credits_df = pd.read_csv("credits_df.csv")
titles_df = pd.read_csv("titles_df.csv")

In [203]:
credits_df.head()

   person_id       id             name                character   role
0       3748  tm84618   Robert De Niro            Travis Bickle  ACTOR
1      14658  tm84618     Jodie Foster            Iris Steensma  ACTOR
2       7064  tm84618    Albert Brooks                      Tom  ACTOR
3       3739  tm84618    Harvey Keitel  Matthew 'Sport' Higgins  ACTOR
4      48933  tm84618  Cybill Shepherd                    Betsy  ACTOR

In [204]:
titles_df.head(2)

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,imdb_id,imdb_score,imdb_votes,tmdb_popularity,tmdb_score
0,ts300399,Five Came Back: The Reference Films,SHOW,This collection includes 12 World War II-era p...,1945,TV-MA,51,['documentation'],['US'],1.0,NaN,NaN,NaN,0.600,NaN
1,tm84618,Taxi Driver,MOVIE,A mentally unstable Vietnam War veteran works ...,1976,R,114,"['drama', 'crime']",['US'],NaN,tt0075314,8.2,808582.0,40.965,8.179

In [205]:
titles_df.shape

(5850, 15)

In [206]:
titles_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5850 entries, 0 to 5849
Data columns (total 15 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    5850 non-null   object
 1   title                 5849 non-null   object
 2   type                  5850 non-null   object
 3   description           5832 non-null   object
 4   release_year          5850 non-null   int64
 5   age_certification     3231 non-null   object
 6   runtime               5850 non-null   int64
 7   genres                5850 non-null   object
 8   production_countries  5850 non-null   object
 9   seasons               2106 non-null   float64
 10  imdb_id               5447 non-null   object
 11  imdb_score            5368 non-null   float64
 12  imdb_votes            5352 non-null   float64
 13  tmdb_popularity       5759 non-null   float64
 14  tmdb_score            5539 non-null   float64
dtypes: float64(5), int64(2), object(8)
memory usage: 685.7+ KB

In [207]:
titles_df.nunique()

id                      5850
title                   5798
type                       2
description             5829
release_year              63
age_certification         11
runtime                  202
genres                  1726
production_countries     452
seasons                   26
imdb_id                 5447
imdb_score                80
imdb_votes              3880
tmdb_popularity         4889
tmdb_score               394
dtype: int64

In [208]:
titles_df["title"].unique()

array(['Five Came Back: The Reference Films', 'Taxi Driver',
       'Deliverance', ..., 'Lokillo',
       'Dad Stop Embarrassing Me - The Afterparty',
       'Mighty Little Bheem: Kite Festival'], dtype=object)

In [209]:
titles_df["title"].isnull()

0       False
1       False
2       False
3       False
4       False
        ...
5845    False
5846    False
5847    False
5848    False
5849    False
Name: title, Length: 5850, dtype: bool

In [210]:
titles_df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
5845    False
5846    False
5847    False
5848    False
5849    False
Length: 5850, dtype: bool

In [211]:
#eliminamos la columna seasons

columns_to_drop = ["seasons"]
titles_df = titles_df.drop(columns = columns_to_drop, axis = 1)

In [212]:
#eliminamos SHOW de columna type

new_type = ["MOVIE"]
titles_df = titles_df[titles_df["type"].isin(new_type) == True]

In [213]:
#eliminamos la columna type

columns_to_drop = ["type"]
titles_df = titles_df.drop(columns = columns_to_drop, axis = 1)

In [215]:
titles_df.nunique()

id                      3744
title                   3724
description             3734
release_year              62
age_certification          5
runtime                  197
genres                  1105
production_countries     418
imdb_id                 3482
imdb_score                74
imdb_votes              2747
tmdb_popularity         3248
tmdb_score               266
dtype: int64

In [216]:
#eliminamos el único título nulo

titles_df = titles_df.dropna(subset=["title"])

titles_df["title"].isnull().sum()

0

In [217]:
#descartamos que haya títulos duplicados que tengan el mismo año de lanzamiento

grouped = titles_df[["title", "release_year"]]
grouped.duplicated().sum()

0

In [218]:
""" Eliminamos las filas que no tienen género:
- Creamos un nuevo dataframe solo con las columnas 'title' y 'genres'.
- Creamos una lista vacía para añadir el id de los registros sin género.
- Quitamos corchetes y comillas de los géneros y creamos una lista nueva que tome cada palabra por separado.
- Si la lista está vacía, la añadimos a la nueva lista.
- Reseteamos el índice.
- Eliminamos las filas sin género del dataframe principal.

"""
grouped_2 = titles_df[["title", "genres"]].reset_index(drop=True)
grouped_2

id_to_erase = []

for name in range(0, len(grouped_2)-1):
    l = titles_df.iloc[name]["genres"].replace('[', "").replace("]", "").replace("'", "").split(", ")
    if l[0] == "":
        id_to_erase.append(name)

titles_df.reset_index(drop=True, inplace=True)

titles_df = titles_df.drop(id_to_erase, axis=0).dropna(subset="genres")

In [219]:
#en todas eliminar espacios inicial y final
#poner todos los valores en minúscula